Tekla Open API Reference for Tekla Structures 2025
ViewBase.GetAllObjects Method (Type[])
 Gets all the objects and their children objects in the view that are of certain types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectEnumerator GetAllObjects(
	Type[] TypeFilter
)
Public Function GetAllObjects (
	TypeFilter As Type()
) As DrawingObjectEnumerator
Parameters
TypeFilter
Type: System.Type[]
The types of the objects to get.
Return Value
Type: DrawingObjectEnumerator
All the objects in the view that are of certain types.
See Also
Reference
ViewBase Class
GetAllObjects Overload
Tekla.Structures.Drawing Namespace